//
//  Dictionary.swift
//  SpyGame
//
//  Created by Artem Vavilov on 18.02.2023.
//

import Foundation

struct Dictionary {
    private static let words: [String] = [
        "База террористов",
        "Банк",
        "Больница",
        "Киностудия",
        "Корпоративная вечеринка",
        "Овощебаза",
        "Партизанский отряд",
        "Пассажирский поезд",
        "Пиратский корабль",
        "Полярная станция",
        "Посольство",
        "Ресторан",
        "Супермаркет",
        "Театр",
        "Университет",
        "Воинская часть",
        "Войско крестоносцев",
        "Казино",
        "Океанский лайнер",
        "Орбитальная станция",
        "Отель",
        "Пляж",
        "Подводная лодка",
        "Полицейский участок",
        "Самолет",
        "Спа-салон",
        "Станция техобслуживания",
        "Церковь",
        "Цирк",
        "Школа"
    ]
    
    static func getLocation() -> String {
        let i = Int.random(in: 0...words.count - 1)
        return words[i]
    }
}
